package main

import "fmt"

func task23() {
	fmt.Println("------------Task 23----------------")

	a := []string{"A", "B", "C", "D", "E"}
	i := 2

	//Первый вариант (сохраняющий порядок)
	copy(a[i:], a[i+1:]) //сдвиг правой части слайса влево
	a[len(a)-1] = ""     //Затирание последнего эл-та
	a = a[:len(a)-1]     //Урезание слайса

	fmt.Println(a)

	//Второй вариант (меняющий порядок)
	a = []string{"A", "B", "C", "D", "E"}

	a[i] = a[len(a)-1] //Переносим последний эл-т в i-ую ячейку
	a[len(a)-1] = ""   //Затираем последний элемент
	a = a[:len(a)-1]   //Урезаем
	fmt.Println(a)

	//Третий вариант
	a = []string{"A", "B", "C", "D", "E"}
	a = append(a[:i], a[i+1:]...) //Комбинация левой и правой части
	fmt.Println(a)
}
